constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

continuousPhaseName water;

transportModel  Newtonian;
nu              1e-06;
rho.water       1000;

//Surface tension coefficients
sigma12		0.05;
sigma13		004;

//Diffusivity between miscible phases
D23		3e-09;

// ************************************************************************* //
