system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 0.001;

vertices
(
    ( 1.5   0   0) //0
    (   0  1.5  0) //1
    (-1.5   0   0) //2
    (   0 -1.5  0) //3

    ( 1.5   0  15) //4
    (   0  1.5 15) //5
    (-1.5   0  15) //6
    (   0 -1.5 15) //7

    ( 0 0 0 ) //8
    ( 0 0 15 ) //9
);

blocks
(
	hex (0 1 8 8 4 5 9 9) (20 20 100) simpleGrading (1 1 1)
hex (1 2 8 8 5 6 9 9) (20 20 100) simpleGrading (1 1 1)
hex (2 3 8 8 6 7 9 9) (20 20 100) simpleGrading (1 1 1)
hex (3 0 8 8 7 4 9 9) (20 20 100) simpleGrading (1 1 1)

);

edges
(
  arc 0 1 (1.06066 1.06066 0)
arc 1 2 (-1.06066 1.06066 0)
arc 2 3 (-1.06066 -1.06066 0)
arc 3 0 (1.06066 -1.06066 0)

  arc 4 5 (1.06066 1.06066 15)
arc 5 6 (-1.06066 1.06066 15)
arc 6 7 (-1.06066 -1.06066 15)
arc 7 4 (1.06066 -1.06066 15)

);

boundary
(
    walls
    {
        type wall;
        faces
        (
            (0 8 8 1)
	    (1 8 8 2)
            (2 8 8 3)
            (3 8 8 0)
        );
    }

    atmosphere
    {
        type patch;
        faces
        (
            (5 9 9 4)
            (6 9 9 5)
            (7 9 9 6)
            (4 9 9 7)
        );
    }

    sides
    {
        type wall;
        faces
        (
            (0 1 5 4)
            (1 2 6 5)
            (2 3 7 6)
            (3 0 4 7)
        );
    }

);

mergePatchPairs
(

);

// ************************************************************************* //
